1D_flame_Lean/Openfoam_solution_Lean/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multicomponentFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5e-4;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

functions
{
    // axial line
    axialLine
    {
        type sets;
	libs ("libsampling.so");
	enabled yes;
	writeControl adjustableRunTime;
	writeInterval 1e-6; 
	fields (T H2 H O O2 OH H2O HO2 H2O2 AR N2);
	interpolationScheme cellPoint;
	setFormat raw;
	sets
	(
	    line1
	    {
	        type lineUniform;
	        axis x;
	        start (0 5e-4 5e-4); 
	        end (50e-3 5e-4 5e-4); 
	        nPoints 10000;
            }
       );
    }
}

// ************************************************************************* //
