1D_flame_Lean/Openfoam_solution_Lean/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue H2 0.028522387
    volScalarFieldValue AR 1e-6
    volScalarFieldValue N2 0.745122605
    volScalarFieldValue O2 0.226354006
    volScalarFieldValue OH 0
    volScalarFieldValue H2O 0
    volScalarFieldValue T 300
);

regions
(
    //- combustion product region
    boxToCell
    {
        box (0.025 -1 -1) (0.055 1 1);

        fieldValues
        (
            volScalarFieldValue H2 1.19276e-03
            volScalarFieldValue O2 8.31862e-03
            volScalarFieldValue H2O 2.39496e-01
            volScalarFieldValue N2 7.45671e-01
            volScalarFieldValue OH 5.32179e-03
            volScalarFieldValue T 2377.93509778 //combustion product temperature
        );
    }
);

// ************************************************************************* //
